SQL and SQLite
SQL(Structured Query Language) is a standard language for managing and manipulating relational DB.
SQLite is a self-contained and zero-configuration DB engine that is widely used for embedded database system.

In [51]:
import sqlite3

In [52]:
# Connect to an SQLite DB
connection = sqlite3.connect("example.db")
connection

In [53]:
cursor = connection.cursor()

In [54]:
# create a Table
cursor.execute('''
Create Table if not Exists employees(
                id Integer Primary Key,
                name Text Not Null,
                age Integer,
                department text
                )
''')

# Commit the changes
connection.commit()

In [55]:
# create a Table
cursor.execute('''
Select * from employees
''')

# Commit the changes
connection.commit()

In [56]:
# Insert the data from sqlite table
cursor.execute('''
Insert Into employees(name, age, department)
               values("Anshu", 22, "Data Scientist")
''')

cursor.execute('''
Insert Into employees(name, age, department)
               values("Modi", 65, "Politics")
''')


cursor.execute('''
Insert Into employees(name, age, department)
               values("Elon", 45, "Scientist")
''')

connection.commit()

In [57]:
# Query the data form the table 
cursor.execute("Select * from employees")
rows = cursor.fetchall()

# print the queried data
for row in rows:
    print(row)

(1, 'Anshu', 20, 'Data Scientist')
(3, 'Elon', 45, 'Scientist')
(4, 'Anshu', 20, 'Data Scientist')
(6, 'Elon', 45, 'Scientist')
(7, 'Anshu', 20, 'Data Scientist')
(9, 'Elon', 45, 'Scientist')
(10, 'Anshu', 22, 'Data Scientist')
(11, 'Modi', 65, 'Politics')
(12, 'Elon', 45, 'Scientist')
(13, 'Anshu', 22, 'Data Scientist')
(14, 'Modi', 65, 'Politics')
(15, 'Elon', 45, 'Scientist')
(16, 'Anshu', 22, 'Data Scientist')
(17, 'Modi', 65, 'Politics')
(18, 'Elon', 45, 'Scientist')
(19, 'Anshu', 22, 'Data Scientist')
(20, 'Modi', 65, 'Politics')
(21, 'Elon', 45, 'Scientist')

In [58]:
# Update the data in table
cursor.execute('''
UPDATE employees
Set age = 20
where name = "Anshu"
''')

connection.commit()

In [59]:
# Query the data form the table 
cursor.execute("Select * from employees")
rows = cursor.fetchall()

# print the queried data
for row in rows:
    print(row)

(1, 'Anshu', 20, 'Data Scientist')
(3, 'Elon', 45, 'Scientist')
(4, 'Anshu', 20, 'Data Scientist')
(6, 'Elon', 45, 'Scientist')
(7, 'Anshu', 20, 'Data Scientist')
(9, 'Elon', 45, 'Scientist')
(10, 'Anshu', 20, 'Data Scientist')
(11, 'Modi', 65, 'Politics')
(12, 'Elon', 45, 'Scientist')
(13, 'Anshu', 20, 'Data Scientist')
(14, 'Modi', 65, 'Politics')
(15, 'Elon', 45, 'Scientist')
(16, 'Anshu', 20, 'Data Scientist')
(17, 'Modi', 65, 'Politics')
(18, 'Elon', 45, 'Scientist')
(19, 'Anshu', 20, 'Data Scientist')
(20, 'Modi', 65, 'Politics')
(21, 'Elon', 45, 'Scientist')

In [60]:
# Delete the data from Table
cursor.execute('''
Delete from employees
               where name = "Modi"
''')

connection.commit()

In [61]:
# Query the data form the table 
cursor.execute("Select * from employees")
rows = cursor.fetchall()

# print the queried data
for row in rows:
    print(row)

(1, 'Anshu', 20, 'Data Scientist')
(3, 'Elon', 45, 'Scientist')
(4, 'Anshu', 20, 'Data Scientist')
(6, 'Elon', 45, 'Scientist')
(7, 'Anshu', 20, 'Data Scientist')
(9, 'Elon', 45, 'Scientist')
(10, 'Anshu', 20, 'Data Scientist')
(12, 'Elon', 45, 'Scientist')
(13, 'Anshu', 20, 'Data Scientist')
(15, 'Elon', 45, 'Scientist')
(16, 'Anshu', 20, 'Data Scientist')
(18, 'Elon', 45, 'Scientist')
(19, 'Anshu', 20, 'Data Scientist')
(21, 'Elon', 45, 'Scientist')

In [62]:
# Working with Sales Data
connection = sqlite3.connect("sales_data.db")
cursor = connection.cursor()

# create a table for sales data
cursor.execute('''
CREATE TABLE IF NOT EXISTS sales(
               id INTEGER PRIMARY KEY,
               date TEXT NOT NULL,
               product TEXT NOT NULL,
               sales INTEGER,
               region TEXT
)
''')

# Insert data into the sales table
sales_data = [
    ('2023-01-01', 'Product1', 100, 'North'),
    ('2023-01-02', 'Product2', 200, 'South'),
    ('2023-01-03', 'Product1', 150, 'East'),
    ('2023-01-04', 'Product3', 250, 'West'),
    ('2023-01-05', 'Product2', 300, 'North')
]

cursor.executemany('''
INSERT into sales(date, product, sales, region)
                   values(?,?,?,?)
''', sales_data)

connection.commit()

In [63]:
# Query the data form the table 
cursor.execute("Select * from employees")
rows = cursor.fetchall()

# print the queried data
for row in rows:
    print(row)

OperationalError: no such table: employees

In [ ]:
connection.close()